AUTO_config_TK_pesok/src/DataProcessors/ТК_ВыгрузитьИзменения_ЗУП/ТК_ВыгрузитьИзменения_ЗУП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТК_ВыгрузитьИзменения_ЗУП</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_РежимыРаботыТорговыхПлощадок/ТК_РежимыРаботыТорговыхПлощадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_РежимыРаботыТорговыхПлощадок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.РежимРаботы</types>
    </type>
  </resources>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/РезультатыВыполненияОбработок/РезультатыВыполненияОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыВыполненияОбработок</name>
  <resources>
    <name>Успешный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СообщенияОбОшибках</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Catalogs/ТорговыеПлощадки/ТорговыеПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговыеПлощадки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьТоварыПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияОС_ТекущиеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен торговая точка</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкоголемНеТоргуем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешительныеДокументы</name>
    <comment>Наличие разрешительных документов по ПБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСистемаАПС</name>
    <comment>Договор на обслуживание системы АПС</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потребители</name>
    <comment>Потребители коммунальных услуг</comment>
    <attributes>
      <name>Потребитель</name>
      <comment>Потребитель коммунальных услуг</comment>
      <type>
        <types>DefinedType.ПотребительКоммунальныхУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекламныеПлоскости</name>
    <attributes>
      <name>Расположение</name>
      <type>
        <types>EnumRef.ПлоскостьПодРекламу</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламныйНоситель</name>
      <type>
        <types>CatalogRef.РекламныеНосители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сюжет</name>
      <type>
        <types>CatalogRef.СюжетыРекламныхНосителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеПоставщиков</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНапитков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чай</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДверей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВывоза</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Огнетушители</name>
    <attributes>
      <name>Огнетушитель</name>
      <type>
        <types>EnumRef.ТипыОгнетушителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующегоТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/ТК_ВыгрузитьИзменения_ЗУП/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
#Область ПрограммныйИнтерфейс
  
Процедура ВыгрузитьДанные() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелОбменаЗУП = ПланыОбмена.ОбменZUP.НайтиПоКоду("ZUP");
	УзелОбменаЗУП_Аттика = ПланыОбмена.ОбменZUP.НайтиПоКоду("ZUP_A");
	
	МассивУзловОбменаЗУП = ПланыОбмена.ОбменZUP.ПолучитьМассивУзловПланаОбмена();
	
	Если МассивУзловОбменаЗУП.Найти(УзелОбменаЗУП_Аттика) <> Неопределено Тогда 
		Параметры = Новый Структура;
		Параметры.Вставить("ИмяБазы", 		"ЗУП_Аттика");
		Параметры.Вставить("Пользователь", 	"obmenTK_ws");
		Параметры.Вставить("Пароль", 		"<fhf<fy");
		Параметры.Вставить("УзелОбмена", 	УзелОбменаЗУП_Аттика);
		Параметры.Вставить("АдресСервиса",	"https://orders-1c.digma.ua/work_UU_Zarplata_Attika/ws/cwd2.1cws?wsdl");
		
		ВыполнитьВыгрузкуГрафикиРаботы(Параметры);
	КонецЕсли;
	
	Если МассивУзловОбменаЗУП.Найти(УзелОбменаЗУП) <> Неопределено Тогда 
		Параметры = Новый Структура;
		Параметры.Вставить("ИмяБазы", 		"ЗУП_УУ");
		Параметры.Вставить("Пользователь", 	"ObmenSSL");
		Параметры.Вставить("Пароль", 		"bynthghbpf");
		Параметры.Вставить("УзелОбмена", 	УзелОбменаЗУП);
		Параметры.Вставить("АдресСервиса",	"https://orders-1c.digma.ua/zuUU/ws/cwd2.1cws?wsdl");
		
		ВыполнитьВыгрузкуГрафикиРаботы(Параметры);
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти
 
 
#Область СлужебныеПроцедурыИФункции 

Функция ПолучитьТаблицуРежимовРаботыТТДляВыгрузкиЗУП(УзелОбмена, ТекстОшибки = "", Отказ = Ложь) Экспорт 	
	
	Отказ = Ложь;
	Ошибки = Новый ТекстовыйДокумент;
	
	ТаблицаРежимов = Новый ТаблицаЗначений;
	ТаблицаРежимов.Колонки.Добавить("ТорговаяПлощадка");
	ТаблицаРежимов.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаРежимов.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаРежимов.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(61));
	ТаблицаРежимов.Колонки.Добавить("РежимРаботыСтрокой", ОбщегоНазначения.ОписаниеТипаСтрока(50));	
	
	Если Не Отказ Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТорговыеПлощадкиИзменения.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ втТорговыеПлощадки
		               |ИЗ
		               |	Справочник.ТорговыеПлощадки.Изменения КАК ТорговыеПлощадкиИзменения
		               |ГДЕ
		               |	ТорговыеПлощадкиИзменения.Узел = &Узел
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втТорговыеПлощадки.Ссылка КАК ТорговаяПлощадка,
		               |	втТорговыеПлощадки.Ссылка.Код КАК Код,
		               |	ЕСТЬNULL(ТК_РежимыРаботыТорговыхПлощадок.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Период,
		               |	ТК_РежимыРаботыТорговыхПлощадок.РежимРаботы.Наименование КАК Наименование,
		               |	ВЫБОР
		               |		КОГДА НЕ ТК_РежимыРаботыТорговыхПлощадок.РежимРаботы.Ссылка ЕСТЬ NULL
		               |			ТОГДА РАЗНОСТЬДАТ(ТК_РежимыРаботыТорговыхПлощадок.РежимРаботы.Будни.Начало, ТК_РежимыРаботыТорговыхПлощадок.РежимРаботы.Будни.Окончание, МИНУТА)
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК РежимБудни,
		               |	ВЫБОР
		               |		КОГДА НЕ ТК_РежимыРаботыТорговыхПлощадок.РежимРаботы.Ссылка ЕСТЬ NULL
		               |			ТОГДА РАЗНОСТЬДАТ(ТК_РежимыРаботыТорговыхПлощадок.РежимРаботы.Выходные.Начало, ТК_РежимыРаботыТорговыхПлощадок.РежимРаботы.Выходные.Окончание, МИНУТА)
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК РежимВыходные
		               |ИЗ
		               |	втТорговыеПлощадки КАК втТорговыеПлощадки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_РежимыРаботыТорговыхПлощадок КАК ТК_РежимыРаботыТорговыхПлощадок
		               |		ПО втТорговыеПлощадки.Ссылка = ТК_РежимыРаботыТорговыхПлощадок.ТорговаяПлощадка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТорговаяПлощадка,
		               |	Период";
		
		Запрос.УстановитьПараметр("Узел", УзелОбмена);			
		
		Результат = Запрос.Выполнить();				
		
		Если Не Результат.Пустой() Тогда 
			Выборка = Результат.Выбрать();
			Разделитель = "|";
			Пока Выборка.Следующий() Цикл 
				НоваяСтрока = ТаблицаРежимов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Код,Период,Наименование,ТорговаяПлощадка");
				
				РежимРаботыСтрокой = "";
				РежимРаботыСтрокой = ДописатьВСтрокуЗначения(РежимРаботыСтрокой, Выборка.РежимБудни, 5, Разделитель);
				РежимРаботыСтрокой = ДописатьВСтрокуЗначения(РежимРаботыСтрокой, Выборка.РежимВыходные, 2, Разделитель);
				
				РежимРаботыСтрокой = СтрЗаменить(РежимРаботыСтрокой, ",", ".");
				РежимРаботыСтрокой = СтрЗаменить(РежимРаботыСтрокой, Разделитель, ",");
				
				НоваяСтрока.РежимРаботыСтрокой = РежимРаботыСтрокой;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Ошибки.КоличествоСтрок() > 0 Тогда 
		ТекстОшибки = Ошибки.ПолучитьТекст();
	КонецЕсли;
	
	Возврат ТаблицаРежимов;
	
КонецФункции

Процедура ВыполнитьВыгрузкуГрафикиРаботы(Параметры, Отказ = Ложь)
			
	ИмяБазы 		= Параметры.ИмяБазы;
	Пользователь	= Параметры.Пользователь;
	Пароль 			= Параметры.Пароль;
	АдресСервиса 	= Параметры.АдресСервиса;
	УзелОбмена		= Параметры.УзелОбмена;
	
	ИдентификаторОбработки = "ТК_ГрафикиРаботы_ЗУП";		
	КлючОбработки = "ВыгрузкаГрафикиРаботы_В_" + ИмяБазы;
	
	СтруктураЗаписиЖурнала = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктураЗаписиЖурнала.КлючОбработки = КлючОбработки;
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Начало обработки.", СтруктураЗаписиЖурнала);
		
	ТаблицаРежимов = Неопределено;	
	ТекстОшибки = "";	
	Попытка
		ТаблицаРежимов = ПолучитьТаблицуРежимовРаботыТТДляВыгрузкиЗУП(УзелОбмена, ТекстОшибки, Отказ);		
	Исключение
		ТекстОшибки = ОписаниеОшибки();	
		Отказ = Истина;		
	КонецПопытки;
	
	ЕстьДанныеДляВыгрузки = Истина;
	
	Если Отказ Тогда  
		Если ПустаяСтрока(ТекстОшибки) Тогда 
			ТекстОшибки = "Ошибка получения данных для обмена";
		КонецЕсли;
		
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния: Ошибка получения данных", СтруктураЗаписиЖурнала);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание: " + ТекстОшибки, СтруктураЗаписиЖурнала);												
	ИначеЕсли ТаблицаРежимов.Количество() = 0 Тогда 		
		ЕстьДанныеДляВыгрузки = Ложь;
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Нет данных для выгрузки", СтруктураЗаписиЖурнала);		
	КонецЕсли;	
	
	Если Не Отказ И ЕстьДанныеДляВыгрузки Тогда 
		Попытка
			Определение = Новый WSОпределения(АдресСервиса, Пользователь,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
			WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
			WS.Пользователь = Пользователь;
			WS.Пароль = Пароль;
		Исключение 	
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния: Не удалось подключится к базе """+ ИмяБазы +"""", СтруктураЗаписиЖурнала);
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание: " + ОписаниеОшибки(), СтруктураЗаписиЖурнала);												
		КонецПопытки;
	КонецЕсли;
	
	
	Если Не Отказ И ЕстьДанныеДляВыгрузки Тогда 
		мТорговыеПлощадки = ТаблицаРежимов.ВыгрузитьКолонку("ТорговаяПлощадка");
		мТорговыеПлощадки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(мТорговыеПлощадки);
		
		ПланыОбмена.ВыбратьИзменения(УзелОбмена, 1, мТорговыеПлощадки);
		
		ТаблицаРежимов.Колонки.Удалить("ТорговаяПлощадка");	
		ХранилищеЗначений = Новый ХранилищеЗначения(ТаблицаРежимов, Новый СжатиеДанных(9));
				
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Выгружено %1 записей по %2 точкам'"),
				ТаблицаРежимов.Количество(),
				мТорговыеПлощадки.Количество()),
			СтруктураЗаписиЖурнала);		
		
		
		ТекстОшибки = "";	
		Попытка
			Ответ = WS.UpdateTradePointsOperationHours(ХранилищеЗначений);					
			
			Если Ответ.Status Тогда 
				Если Не ПустаяСтрока(Ответ.Description) Тогда 
					РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(Ответ.Description, СтруктураЗаписиЖурнала);
				КонецЕсли;
				
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, 1);
			Иначе
				Отказ = Истина;
				ТекстОшибки = Ответ.Description;
			КонецЕсли;
		Исключение
			Отказ = Истина;		
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		Если Отказ Тогда 
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния: Ошибка обмена данными", СтруктураЗаписиЖурнала);
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание: " + ТекстОшибки, СтруктураЗаписиЖурнала);												
		КонецЕсли;
	КонецЕсли;
	
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, Не Отказ);		
	
КонецПроцедуры


#КонецОбласти
 
#Область ПрочиеПроцедурыИФункции

Функция ДописатьВСтрокуЗначения(Знач ТекстСтрока, Знач Значение, КоличествоПовторов, Разделитель = ",")
	
	Если ПустаяСтрока(Значение) Тогда 
		Возврат ТекстСтрока;
	КонецЕсли;
	
	РежимЧас = Окр(Значение / 60, 1);
	
	Для Ит = 1 По КоличествоПовторов Цикл 
		Если Не ПустаяСтрока(ТекстСтрока) Тогда 
			ТекстСтрока = ТекстСтрока + Разделитель;
		КонецЕсли;
		
		ТекстСтрока = ТекстСтрока + СокрЛП(РежимЧас);
	КонецЦикла;
		
	Возврат ТекстСтрока;

	
КонецФункции


#КонецОбласти
 
  
#КонецЕсли
